app/Controllers/HewanDarat.php

    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $mhs = new ModelHewanDarat();
            $data = [
                'tampildata' => $mhs->findAll()
            ];
---
SELECT *
FROM `hewan_darat`

                    'status' => $this->request->getPost('status'),
                ];
                $mhs = new ModelHewanDarat();
                $mhs->insert($simpandata);
---
INSERT INTO `hewan_darat` (`id`, `nama`, `habitat`, `pola_makan`, `status`) VALUES ('2', 'samuel', 'darat', 'Omnivora', 'Terancam')

    public function formedit()
    {
        if ($this->request->isAJAX()) {
            $id_hewan = $this->request->getVar('id_hewan');

            $mhs = new ModelHewanDarat();
            $row = $mhs->find($id_hewan);
---
SELECT *
FROM `hewan_darat`
WHERE `hewan_darat`.`id_hewan` = '2'

    public function hapus()
    {
        if ($this->request->isAJAX()) {
            // jika benar/valid



            $id_hewan = $this->request->getVar('id_hewan');
            $mhs = new ModelHewanDarat();
            $mhs->delete($id_hewan);
---
DELETE FROM `hewan_darat`
WHERE `id_hewan` IN ('1')