app/Controllers/HewanAmfibi.php

SELECT *
FROM `hewan_amfibi`
---
    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $mhs = new ModelHewanAmfibi();
            $data = [
                'tampildata' => $mhs->findAll()
            ];