app/Controllers/HewanAir.php

    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $mhs = new ModelHewanAir();
            $data = [
                'tampildata' => $mhs->findAll()
            ];
---
SELECT *
FROM `hewan_air`

    public function hapus()
    {
        if ($this->request->isAJAX()) {
            // jika benar/valid



            $id_hewan = $this->request->getVar('id_hewan');
            $mhs = new ModelHewanAir();
            $mhs->delete($id_hewan);
---
DELETE FROM `hewan_air`
WHERE `id_hewan` IN ('2')