app/Controllers/HewanUdara.php

    public function ambildata()
    {
        if ($this->request->isAJAX()) {
            $mhs = new ModelHewanUdara();
            $data = [
                'tampildata' => $mhs->findAll()
            ];
---
SELECT *
FROM `hewan_udara`

    public function formedit()
    {
        if ($this->request->isAJAX()) {
            $id_hewan = $this->request->getVar('id_hewan');

            $mhs = new ModelHewanUdara();
            $row = $mhs->find($id_hewan);
---
SELECT *
FROM `hewan_udara`
WHERE `hewan_udara`.`id_hewan` = '3'